---
kind: method
id: M:Autodesk.Revit.DB.HostedSweep.HorizontalFlip
source: html/c64cb45b-74b9-acef-db86-62931b11b1ee.htm
---
# Autodesk.Revit.DB.HostedSweep.HorizontalFlip Method

Flip the hosted sweep object along horizontal line.

## Syntax (C#)
```csharp
public void HorizontalFlip()
```